trunk/raw/documents/en.org
#+BEGIN_COMMENT
User guide (English).

Copyright (C) 2010-2012.

This file is part of Redirector.

Redirector is free software: you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation, either version 3 of the License, or
(at your option) any later version.

Redirector is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
GNU General Public License for more details.

You should have received a copy of the GNU General Public License
along with Redirector.  If not, see <http://www.gnu.org/licenses/>.

From Cyril Feng.
#+END_COMMENT

#+TITLE:     Redirector Guide
#+AUTHOR:    Cyril Feng
#+EMAIL:     CyrilFeng@gmail.com
#+DATE:      2012-04-02
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:
#+LINK_HOME:
#+XSLT:

#+STYLE: <style>table{margin:auto auto;}</style>
#+STYLE: <style>body{padding:0 20px;}</style>
#+STYLE: <style>i{font-weight:bold;}</style>
#+STYLE: <style>code{background-color:lightgray;font-size:90%}</style>

* Preface
  This guide was created as an introduction to /Redirector/,
  the /Chromium/ / /Google Chrome/ extension that redirects URLs
  either automatically or manually.
  Rather than covering every aspect of /Redirector/,
  this guide will mainly focus on composing the rules.

* Conventions
  - /Cr/ :: The /Chromium/ / /Google Chrome/ browser

  - /RegExp/ :: Regular expression

  - =~ :: matches or is matched with

  - !~ :: unmatches or is unmatched with

  - @<code>...@</code> :: Placeholder for the contents

  - -> :: redirects to

* How it works
  /Redirector/ handles every web request
  at the very beginning of its creation,
  when DNS resolving, connection to the server, etc have not started.
  Note that even when you browsing a single web-page,
  multiple web request is likely to be created, e.g., to load images.
  /Redirector/ simply handles all of them.

  /Redirector/ will first check if the URL of a request matches
  any of the automatic redirection rules,
  If so, the URL will be modified/blocked
  according to the *first* matched rule.

  *NOTE:*
  Such process *happens ONLY ONCE*.
  Actually the redirected URL will trigger the same process,
  which will be ignored by /Redirector/.
  The same thing happens to a server-initiated redirection.
  This mechanism ensures that
  no (infinite) redirection loop will be created,
  which easily freezes /Cr/.
  In fact, even if /Redirector/ carries out a second redirection,
  no third one will be triggered,
  as it's an intrinsic security feature of /Cr/.

  A manual redirection is just like a forced process of above,
  without match checking.

  It's another independent yet analogous process
  for /Redirector/ to manipulate HTTP request headers.
  If there're any rules matching the URL of a web request,
  the first will be picked up to modify the headers.

  *NOTE:*
  Such process normally *happens ONLY ONCE*,
  but there's an exception:
  if a server-initiated redirection is triggered,
  /Redirector/ will try to modify its headers again.
  It's because previous headers have been sent and
  totally new headers have been generated.

  /Redirector/ comes with a debugger,
  ideal for monitoring processes mentioned above.
  It can help you to better understand
  the internal time sequential relationship.
  For example, you will notice that headers handling always
  takes place after a redirection checking.
  If a redirection occurs after headers handling,
  then it's probably a server-initiated redirection.

* Basic Usage
  In this part,
  you're about to learn how to configure /Redirector/ and compose basic rules.

** Protocols
   Normally,
   /Redirector/ handles =HTTP://=, =HTTPS://=, =FTP://= and =FILE://= protocols,
   but you may want to disable some of them in /Preferences/ tab.

   *NOTE:*
   If you ever managed to get /Redirector/ manipulating URLs begin with other protocol
   e.g. =chrome://=, don't rely on that.

** Manual Redirection
   /Redirector/ is mainly used to redirect URLs automatically,
   while there're many situations auto-redirection is unfit for.
   As an alternative, you should consider manual redirection.

   There're basically two ways:
   - Right click on a link and select a rule,
     the link will be loaded in a new tab with the rule appling to its URL;
   - Right click on a page and select a rule,
     this page will be reloaded with the rule appling to it's URL.

   *NOTE:*
   You need at least one [[BASIC-MATCH-MANUAL][Manual rule]] created and enabled,
   or there won't be anything about /Redirector/ in context menus.

** Configure Rules
   To add a rule, press the plus button,
   so the rule editor will turn up.
   You may either select a built-in rule or compose one yourself.

   *NOTE:* built-in rules are for reference use only. Some of them
   are just skeletons, useless without modifications.

   You may press <Enter> key or double click on the a rule to edit it,
   or press <Delete> key to delete it.
   If multiple rules are created, their priorities can be changed through
   j/k, arrow keys or mouse draging.

   *NOTE:* Rules are searched from top to bottom, with disabled ones
   ignored.

   Make a backup of the rules list with /Backup/,
   and the backup file will be downloaded.
   Restorations are done with /Restore/.
   You may also choose a rule and export it.
   Importation is the reverse process of it.
   For online rules (e.g. as attachments),
   you may right click on that link and select "import this rule".

** Basic Syntax of Rules
*** Name
    The name of the rule. Make it as distinctive as possible.

*** Match
    A /Match/ pattern defines which URLs this rule will apply to.
    You may want to check the option /Ignore case/ to perform a
    case-insensitive match.
    /Match/ patterns are typically in three forms:
**** /RegExp/
     Matching with /RegExp/ will be introduced in
     [[ADVANCED_MATCH][Advanced Match]]

