trunk/html/en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Redirector Guide</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Redirector Guide"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-02"/>
<meta name="author" content="Cyril Feng"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Redirector Guide</h1>





<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Preface</a></li>
<li><a href="#sec-2">2 Conventions</a></li>
<li><a href="#sec-3">3 How it works</a></li>
<li><a href="#sec-4">4 Basic Usage</a>
<ul>
<li><a href="#sec-4-1">4.1 Protocols</a></li>
<li><a href="#sec-4-2">4.2 Manual Redirection</a></li>
<li><a href="#sec-4-3">4.3 Configure Rules</a></li>
<li><a href="#sec-4-4">4.4 Basic Syntax of Rules</a>
<ul>
<li><a href="#sec-4-4-1">4.4.1 Name</a></li>
<li><a href="#sec-4-4-2">4.4.2 Match</a></li>
<li><a href="#sec-4-4-3">4.4.3 Substitution</a></li>
<li><a href="#sec-4-4-4">4.4.4 Replacement</a></li>
</ul>
</li>
<li><a href="#sec-4-5">4.5 Test</a></li>
<li><a href="#sec-4-6">4.6 Debugger</a></li>
</ul>
</li>
<li><a href="#sec-5">5 Advanced Match</a></li>
<li><a href="#sec-6">6 Advanced Substitution &amp; Replacement</a></li>
<li><a href="#sec-7">7 Troubleshooting</a></li>
<li><a href="#sec-8">8 Suggestions</a>
<ul>
<li><a href="#sec-8-1">8.1 Composing efficient <i>Match</i> patterns</a></li>
<li><a href="#sec-8-2">8.2 Composing maintainable <i>Substitution</i>s</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Preface</h2>
<div class="outline-text-2" id="text-1">

<p>  This guide was created as an introduction to <i>Redirector</i>,
  the <i>Chromium</i> / <i>Google Chrome</i> extension that redirects URLs
  either automatically or manually.
  Rather than covering every aspect of <i>Redirector</i>,
  this guide will mainly focus on composing the rules.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Conventions</h2>
<div class="outline-text-2" id="text-2">

<dl>
<dt><i>Cr</i></dt><dd>The <i>Chromium</i> / <i>Google Chrome</i> browser

</dd>
<dt><i>RegExp</i></dt><dd>Regular expression

</dd>
<dt>=~</dt><dd>matches or is matched with

</dd>
<dt>!~</dt><dd>unmatches or is unmatched with

</dd>
<dt><code>&hellip;</code></dt><dd>Placeholder for the contents

</dd>
<dt>-&gt;</dt><dd>redirects to
</dd>
</dl>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> How it works</h2>
<div class="outline-text-2" id="text-3">

<p>  <i>Redirector</i> handles every web request
  at the very beginning of its creation,
  when DNS resolving, connection to the server, etc have not started.
  Note that even when you browsing a single web-page,
  multiple web request is likely to be created, e.g., to load images.
  <i>Redirector</i> simply handles all of them.
</p>
<p>
  <i>Redirector</i> will first check if the URL of a request matches
  any of the automatic redirection rules,
  If so, the URL will be modified/blocked
  according to the <b>first</b> matched rule.
</p>
<p>
  <b>NOTE:</b>
  Such process <b>happens ONLY ONCE</b>.
  Actually the redirected URL will trigger the same process,
  which will be ignored by <i>Redirector</i>.
  The same thing happens to a server-initiated redirection.
  This mechanism ensures that
  no (infinite) redirection loop will be created,
  which easily freezes <i>Cr</i>.
  In fact, even if <i>Redirector</i> carries out a second redirection,
  no third one will be triggered,
  as it's an intrinsic security feature of <i>Cr</i>.
</p>
<p>
  A manual redirection is just like a forced process of above,
  without match checking.
</p>
<p>
  It's another independent yet analogous process
  for <i>Redirector</i> to manipulate HTTP request headers.
  If there're any rules matching the URL of a web request,
  the first will be picked up to modify the headers.
</p>
<p>
  <b>NOTE:</b>
  Such process normally <b>happens ONLY ONCE</b>,
  but there's an exception:
  if a server-initiated redirection is triggered,
  <i>Redirector</i> will try to modify its headers again.
  It's because previous headers have been sent and
  totally new headers have been generated.
</p>
<p>
  <i>Redirector</i> comes with a debugger,
  ideal for monitoring processes mentioned above.
  It can help you to better understand
  the internal time sequential relationship.
  For example, you will notice that headers handling always
  takes place after a redirection checking.
  If a redirection occurs after headers handling,
  then it's probably a server-initiated redirection.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Basic Usage</h2>
<div class="outline-text-2" id="text-4">

<p>  In this part,
  you're about to learn how to configure <i>Redirector</i> and compose basic rules.
</p>

</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Protocols</h3>
<div class="outline-text-3" id="text-4-1">

<p>   Normally,
   <i>Redirector</i> handles <code>HTTP://</code>, <code>HTTPS://</code>, <code>FTP://</code> and <code>FILE://</code> protocols,
   but you may want to disable some of them in <i>Preferences</i> tab.
</p>
<p>
   <b>NOTE:</b>
   If you ever managed to get <i>Redirector</i> manipulating URLs begin with other protocol
   e.g. <code>chrome://</code>, don't rely on that.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Manual Redirection</h3>
<div class="outline-text-3" id="text-4-2">

<p>   <i>Redirector</i> is mainly used to redirect URLs automatically,
   while there're many situations auto-redirection is unfit for.
   As an alternative, you should consider manual redirection.
</p>
<p>
   There're basically two ways:
</p><ul>
<li>Right click on a link and select a rule,
     the link will be loaded in a new tab with the rule appling to its URL;
</li>
<li>Right click on a page and select a rule,
     this page will be reloaded with the rule appling to it's URL.
</li>
</ul>


<p>
   <b>NOTE:</b>
   You need at least one <a href="#sec-4-4-2-3">Manual rule</a> created and enabled,
   or there won't be anything about <i>Redirector</i> in context menus.
</p>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Configure Rules</h3>
<div class="outline-text-3" id="text-4-3">

<p>   To add a rule, press the plus button,
   so the rule editor will turn up.
   You may either select a built-in rule or compose one yourself.
</p>
<p>
   <b>NOTE:</b> built-in rules are for reference use only. Some of them
   are just skeletons, useless without modifications.
</p>
<p>
   You may press &lt;Enter&gt; key or double click on the a rule to edit it,
   or press &lt;Delete&gt; key to delete it.
   If multiple rules are created, their priorities can be changed through
   j/k, arrow keys or mouse draging.
</p>
<p>
   <b>NOTE:</b> Rules are searched from top to bottom, with disabled ones
   ignored.
</p>
<p>
   Make a backup of the rules list with <i>Backup</i>,
   and the backup file will be downloaded.
   Restorations are done with <i>Restore</i>.
   You may also choose a rule and export it.
   Importation is the reverse process of it.
   For online rules (e.g. as attachments),
   you may right click on that link and select "import this rule".
</p>
</div>

</div>

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Basic Syntax of Rules</h3>
<div class="outline-text-3" id="text-4-4">


</div>

<div id="outline-container-4-4-1" class="outline-4">
<h4 id="sec-4-4-1"><span class="section-number-4">4.4.1</span> Name</h4>
<div class="outline-text-4" id="text-4-4-1">

<p>    The name of the rule. Make it as distinctive as possible.
</p>
</div>

</div>

<div id="outline-container-4-4-2" class="outline-4">
<h4 id="sec-4-4-2"><span class="section-number-4">4.4.2</span> Match</h4>
<div class="outline-text-4" id="text-4-4-2">

<p>    A <i>Match</i> pattern defines which URLs this rule will apply to.
    You may want to check the option <i>Ignore case</i> to perform a
    case-insensitive match.
    <i>Match</i> patterns are typically in three forms:
</p><ul>
<li id="sec-4-4-2-1"><i>RegExp</i><br/>
     Matching with <i>RegExp</i> will be introduced in
     <a href="#sec-5">Advanced Match</a>

</li>
</ul>
<ul>
<li id="sec-4-4-2-2">Wildcard<br/>
