trunk/raw/documents/en.org
**** Wildcard
     Wildcards are normal strings, except for two special characters:
     - ~?~ :: Matches any single character. e.g.
              - ~https://www.google.com.??/~
                =~ ~https://www.google.com.hk/~.

     - ~*~ :: Matches any string, including an empty one, e.g.
              - ~https://*google.com/~
                =~ ~https://www.google.com/~
                and =~ ~https://google.com/~.

     *NOTE:*
     - If you want to match these two characters literally, use
       ~\?~ and ~\*~ instead.
     - A URL matches a /Match/ pattern so long as part of it matches.
       For strict matching, see /Smart wildcard/.

#<<BASIC-MATCH-MANUAL>>
**** Manual
     A special type of /Match/ method, indicating this rule is used
     for manual redirection.

**** Smart wildcard
     /Smart wildcard/ was introduced to facilitate
     the composing of /Match/ patterns.
     Features:
     - Smart wildcard do strictly matching
     - Patterns without the protocol part will match
       either http:// or https://
     - For patterns without paths, query strings and fragment identifiers,
       A implied slash will be automatically appended.

*** Substitution
    A /Substitution/ defined which part(s) of a URL should be replaced.
    Case-insensitive search is enabled by checking /Ignore case/,
    and search won't stop on the first match when /Global match/ is checked.
    @<i>Substitution@</i>s are also in three forms:
**** /RegExp/
     Substituting with /RegExp/ will be explained in
     [[ADVANCED_SUBSTITUTION][Advanced Substitution & Replacement]].

**** Wildcard
     Same with that of /Match/.

**** Block
     Instead of redirecting a URL, you may alternatively block it.

**** Header
     This option allows you to modify "HTTP request headers".
     /Substitution/ stands for the name of the header to be modified.
     If a header is not found, then it'll be created.
     To delete a header,
     place a minus sign ~-~ in front of its name.
     To modify multiple headers,
     seperate thme by vertical lines ~|~.

*** Replacement
    A /Replacement/ is what used to replace the /Substitution/.
    You may simply use a string,
    but a literal dollar sign ~$~ should be written as ~$$~,
    as
    [[ADVANCED_SUBSTITUTION][Advanced Substitution & Replacement]]
    requires it.

    You may check the /Decode URL/ option,
    which results in the encoded characters of the final URL replaced
    with the corresponding ones, e.g.
    - ~http%3A%2F%2Fwww.google.com%2F~ to ~http://www.google.com/~.

    Note that /Replacement/ for /Substitution/ of type header differs.
    Here it's the corresponding values of headers also seperated by ~|~.
    Use ~\|~ instead if a value contains a literal ~|~.
    You may leave the value blank if header is to be deleted.

** Test
   You are encouraged to test every rules you composed,
   or /Cr/ would probably freeze up or complain "He's Dead, Jim!".
   An easy test utility is included in the rule editor.
   Here're only some tips:

   - When making a new rule,
     select /Match/ as /Manual/ and compose /Substitution/ together with /Replacement/ first.
     You should never move on until the test passed.
     Save /Substitution/ and /Replacement/ before composing /Match/.

   - When debugging an existing rule,
     simplify the potential buggy parts first.
     If you get one rule messed up, discard changes and start from scratch.

   If every thing works, the test result will show up with substituted
   part and its replacement colored.

** Debugger
   Debugger is introduced since /Redirector/ ver.2.2.8
   to make it easier to find out problems with rules.
   Matters need attention:

   - First lines of each debug record indicate the time sequence.
     Time of first record is in the form of ~[hh:mm:ss]~ and
     others in ~[+ElapsedTimeInMilliseconds ms]~.

   - The /Test speed/ option is surely to delay the whole debug session
     since /Redirector/ has to test for one million times to get the result.
     That is to say,
     if a redirection takes up 0.5@<span>\mu@</span>s to finish,
     you're likely to experience a delay of 0.5s.

   - Sum of time elapsed in redirection and headers modification is
     an estimation of how long /Redirector/ will take in reality.

   *WARN:* Redirector will temporarily put normal works aside
   until debugging session finishes
   (when you click on the stop button,
   close the debugee tab or quit the options page).

#<<ADVANCED_MATCH>>
