trunk/html/en.html
     Wildcards are normal strings, except for two special characters:
<dl>
<dt><code>?</code></dt><dd>Matches any single character. e.g.
<ul>
<li><code>https://www.google.com.??/</code>
                =~ <code>https://www.google.com.hk/</code>.

</li>
</ul>

</dd>
<dt><code>*</code></dt><dd>Matches any string, including an empty one, e.g.
<ul>
<li><code>https://*google.com/</code>
                =~ <code>https://www.google.com/</code>
                and =~ <code>https://google.com/</code>.
</li>
</ul>

</dd>
</dl>


<p>
     <b>NOTE:</b>
</p><ul>
<li>If you want to match these two characters literally, use
       <code>\?</code> and <code>\*</code> instead.
</li>
<li>A URL matches a <i>Match</i> pattern so long as part of it matches.
       For strict matching, see <i>Smart wildcard</i>.
</li>
</ul>


</li>
</ul>
<ul>
<li id="sec-4-4-2-3"><a name="BASIC-MATCH-MANUAL" id="BASIC-MATCH-MANUAL"></a>Manual<br/>
     A special type of <i>Match</i> method, indicating this rule is used
     for manual redirection.

</li>
</ul>
<ul>
<li id="sec-4-4-2-4">Smart wildcard<br/>
     <i>Smart wildcard</i> was introduced to facilitate
     the composing of <i>Match</i> patterns.
     Features:
<ul>
<li>Smart wildcard do strictly matching
</li>
<li>Patterns without the protocol part will match
       either <a href="http://">http://</a> or <a href="https://">https://</a>
</li>
<li>For patterns without paths, query strings and fragment identifiers,
       A implied slash will be automatically appended.
</li>
</ul>


</li>
</ul>
</div>

</div>

<div id="outline-container-4-4-3" class="outline-4">
<h4 id="sec-4-4-3"><span class="section-number-4">4.4.3</span> Substitution</h4>
<div class="outline-text-4" id="text-4-4-3">

<p>    A <i>Substitution</i> defined which part(s) of a URL should be replaced.
    Case-insensitive search is enabled by checking <i>Ignore case</i>,
    and search won't stop on the first match when <i>Global match</i> is checked.
    <i>Substitution</i>s are also in three forms:
</p><ul>
<li id="sec-4-4-3-1"><i>RegExp</i><br/>
     Substituting with <i>RegExp</i> will be explained in
     <a href="#sec-6">Advanced Substitution &amp; Replacement</a>.

</li>
</ul>
<ul>
<li id="sec-4-4-3-2">Wildcard<br/>
     Same with that of <i>Match</i>.

</li>
</ul>
<ul>
<li id="sec-4-4-3-3">Block<br/>
     Instead of redirecting a URL, you may alternatively block it.

</li>
</ul>
<ul>
<li id="sec-4-4-3-4">Header<br/>
     This option allows you to modify "HTTP request headers".
     <i>Substitution</i> stands for the name of the header to be modified.
     If a header is not found, then it'll be created.
     To delete a header,
     place a minus sign <code>-</code> in front of its name.
     To modify multiple headers,
     seperate thme by vertical lines <code>|</code>.

</li>
</ul>
</div>

</div>

<div id="outline-container-4-4-4" class="outline-4">
<h4 id="sec-4-4-4"><span class="section-number-4">4.4.4</span> Replacement</h4>
<div class="outline-text-4" id="text-4-4-4">

<p>    A <i>Replacement</i> is what used to replace the <i>Substitution</i>.
    You may simply use a string,
    but a literal dollar sign <code>$</code> should be written as <code>$$</code>,
    as
    <a href="#sec-6">Advanced Substitution &amp; Replacement</a>
    requires it.
</p>
<p>
    You may check the <i>Decode URL</i> option,
    which results in the encoded characters of the final URL replaced
    with the corresponding ones, e.g.
</p><ul>
<li><code>http%3A%2F%2Fwww.google.com%2F</code> to <code>http://www.google.com/</code>.
</li>
</ul>


<p>
    Note that <i>Replacement</i> for <i>Substitution</i> of type header differs.
    Here it's the corresponding values of headers also seperated by <code>|</code>.
    Use <code>\|</code> instead if a value contains a literal <code>|</code>.
    You may leave the value blank if header is to be deleted.
</p>
</div>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5"><span class="section-number-3">4.5</span> Test</h3>
<div class="outline-text-3" id="text-4-5">

<p>   You are encouraged to test every rules you composed,
   or <i>Cr</i> would probably freeze up or complain "He's Dead, Jim!".
   An easy test utility is included in the rule editor.
   Here're only some tips:
</p>
<ul>
<li>When making a new rule,
     select <i>Match</i> as <i>Manual</i> and compose <i>Substitution</i> together with <i>Replacement</i> first.
     You should never move on until the test passed.
     Save <i>Substitution</i> and <i>Replacement</i> before composing <i>Match</i>.

</li>
<li>When debugging an existing rule,
     simplify the potential buggy parts first.
     If you get one rule messed up, discard changes and start from scratch.
</li>
</ul>


<p>
   If every thing works, the test result will show up with substituted
   part and its replacement colored.
</p>
</div>

</div>

<div id="outline-container-4-6" class="outline-3">
<h3 id="sec-4-6"><span class="section-number-3">4.6</span> Debugger</h3>
<div class="outline-text-3" id="text-4-6">

<p>   Debugger is introduced since <i>Redirector</i> ver.2.2.8
   to make it easier to find out problems with rules.
   Matters need attention:
</p>
<ul>
<li>First lines of each debug record indicate the time sequence.
     Time of first record is in the form of <code>[hh:mm:ss]</code> and
     others in <code>[+ElapsedTimeInMilliseconds ms]</code>.

</li>
<li>The <i>Test speed</i> option is surely to delay the whole debug session
     since <i>Redirector</i> has to test for one million times to get the result.
     That is to say,
     if a redirection takes up 0.5<span>&mu;</span>s to finish,
     you're likely to experience a delay of 0.5s.

</li>
<li>Sum of time elapsed in redirection and headers modification is
     an estimation of how long <i>Redirector</i> will take in reality.
</li>
</ul>


<p>
   <b>WARN:</b> Redirector will temporarily put normal works aside
   until debugging session finishes
   (when you click on the stop button,
   close the debugee tab or quit the options page).
</p>
</div>
</div>

</div>
