trunk/raw/documents/en.org
* Advanced Match
  @<i>Advanced Match@</i>es are achieved with the aid of /RegExp/.
  You may refer to other guides on /RegExp/,
  but keep in mind that there're various forms,
  and what you employ here is of JavaScript flavor,
  one fork of Perl flavor /RegExp/.

  As it's impossible to show you all facts about /RegExp/ in so short
  a guide,
  here we will only cover those have something to do with URL matching,
  and draw out their meanings only applicable to real URLs.

  One basic component of /RegExp/ is meta-characters, characters with
  special meanings, as the table below presents:

| Meta-Character         | Meaning                         |
|------------------------+---------------------------------|
| ~\~                    | Escape the next character       |
| ~^~                    | Matches the beginning of a URL  |
| ~$~                    | Matches the end of a URL        |
| ~.~                    | Matches any character           |
| @<code>\vert@</code>   | Alternation                     |
|------------------------+---------------------------------|
| @<code>[...]@</code>   | Character class                 |
| @<code>[\^...]@</code> | Antonym of @<code>[...]@</code> |

  If you want to match a meta-character (or a quantifier, see below) literally,
  a backslash is required to escape the special meaning,
  e.g.
  - ~https://www\.gogole\.com/~
    =~ ~https://www.google.com/~.

  ~^~ and ~$~ are both anchors, which match specific positions rather
  than any real characters, e.g.
  - ~^https://~ =~ ~https://www.google.com/~
    while !~ ~http://www.google.com/search?q=https~.

  Besides ~^~ and ~$~, there're other anchors, belonging to the
  /Escape Sequences/:

| Anchor | Meaning                      |
|--------+------------------------------|
| ~\b~   | Matches the border of a word |
| ~\B~   | Antonym of ~\b~              |

  ~|~ means alternation, e.g.
  - ~https://www.google.com~ =~ ~google|yahoo~
    while !~ ~http://www.bing.com~.

  Actually, ~|~ is more useful in /groups/.

  A character class is a group of characters that it matches, e.g.
  - ~[aA]~ =~ either ~a~ or ~A~

  Hyphens ~-~ in character classes mean a range of characters in
  ASCII table, e.g.
  - ~[a-z]~ =~ any lowercase letter
  - ~[0-9]~ =~ any digit

  *NOTE:*
  To place a literal hyphen in a character class,
  use ~\-~ instead.
  ~-~ is literal in other context.

  There're some predefined "character classes",
  also in the form of /Escape Sequences/:

| Escape Sequence | Meaning                                         |
|-----------------+-------------------------------------------------|
| ~\w~            | Matches a word character (alphanum, underscore) |
| ~\W~            | Antonym of ~\w~                                 |
| ~\d~            | Matches a digit                                 |
| ~\D~            | Antonym of ~\d~                                 |
| ~\ddd~          | Matches the No.ddd (OCT) ASCII character        |
| ~\xdd~          | Matches the No.dd (HEX) ASCII character         |
| ~\udddd~        | Matches the No.dddd (HEX) Unicode character     |

  Another basic component of /RegExp/ is quantifiers,
  they're used as suffixes after characters, meta-characters or /groups/,
  to indicate how many time the character should be repeated:

| Quantifier | Meaning                              |
|------------+--------------------------------------|
| ~*~        | Zero or more, as many as possible    |
| ~+~        | At least one, as many as possible    |
| ~?~        | Zero or one, as many as possible     |
| ~{N}~      | Exactly N                            |
| ~{N,}~     | At least N, as many as possible      |
| ~{N,M}~    | Between N and M, as many as possible |

  e.g.
  - ~^https://www\.google\.com/*~
    =~ any URL begins with ~https://www.google.com/~;
  - ~^http?://~
    =~ any URL begins with ~http://~ or ~https://~.

  By default, /Redirector/ matches in "greedy" mode,
  which means it will match as many characters as possible.
  Place a ~?~ after the quantifier to turn it to "lazy" mode,
  e.g.
  - ~https://.*?\.~ will match ~https://www.~ in string
    ~https://www.google.com~
    while ~https://.*\.~ will match ~https://www.google.~.

  One pattern can be isolated through the use of parentheses, called
  /grouping/:

| Grouping               | Meaning                |
|------------------------+------------------------|
| @<code>(...)@</code>   | Capturing grouping     |
| @<code>(?:...)@</code> | Non-capturing grouping |

  Contents in capturing groups are automatically saved in special
  variables ~\1~ to ~\99~,
  numbered from left to right, from outside to inside.
  Capturing groups can do /back reference/,
  e.g.
  - ~http://(\w+)\.wikipedia\.org/\1/~ =~
    ~http://zh.wikipedia.org/zh/Google~
    while !~ ~http://zh.wikipedia.org/zh-cn/Google~

  In /RegExp/, /Extended Pattern/ is of the form
  @<code>(?x...)@</code>, e.g. @<code>(?:...)@</code>.
  Here are the rest:

| Extended Pattern       | Meaning                           |
|------------------------+-----------------------------------|
| @<code>(?=...)@</code> | Followed by @<code>...@</code>    |
| @<code>(?!...)@</code> | Antonym of @<code>(?=...)@</code> |

  The pattern @<code>(?!...)@</code> is quite useful,
  as /Redirector/ doesn't come with the so-called /blacklist/,
  because you can completely avoid its use.
  For example, for a rule matching ~A~ but not matching ~B~,
  you may compose it as ~^(?!.*B).*A~.
  e.g.
  - Compose a /Match/ pattern matching all URL belong to google.com
    and its subdomains but code.google.com:
    - ~^(?!.*https?://code\.google\.com)https?://(.*?\.)?google\.com~
    - A more compact one:
      ~^https?://(?!code)(.*?\.)?google.com~

  *Note:*
  @<code>(?=...)@</code> or @<code>(?!...)@</code> captures nothing.

#<<ADVANCED_SUBSTITUTION>>
