trunk/html/en.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><a name="ADVANCED_MATCH" id="ADVANCED_MATCH"></a><span class="section-number-2">5</span> Advanced Match</h2>
<div class="outline-text-2" id="text-5">

<p>  <i>Advanced Match</i>es are achieved with the aid of <i>RegExp</i>.
  You may refer to other guides on <i>RegExp</i>,
  but keep in mind that there're various forms,
  and what you employ here is of JavaScript flavor,
  one fork of Perl flavor <i>RegExp</i>.
</p>
<p>
  As it's impossible to show you all facts about <i>RegExp</i> in so short
  a guide,
  here we will only cover those have something to do with URL matching,
  and draw out their meanings only applicable to real URLs.
</p>
<p>
  One basic component of <i>RegExp</i> is meta-characters, characters with
  special meanings, as the table below presents:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Meta-Character</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>\</code></td><td class="left">Escape the next character</td></tr>
<tr><td class="left"><code>^</code></td><td class="left">Matches the beginning of a URL</td></tr>
<tr><td class="left"><code>$</code></td><td class="left">Matches the end of a URL</td></tr>
<tr><td class="left"><code>.</code></td><td class="left">Matches any character</td></tr>
<tr><td class="left"><code>&#124;</code></td><td class="left">Alternation</td></tr>
</tbody>
<tbody>
<tr><td class="left"><code>[&hellip;]</code></td><td class="left">Character class</td></tr>
<tr><td class="left"><code>[^&hellip;]</code></td><td class="left">Antonym of <code>[&hellip;]</code></td></tr>
</tbody>
</table>


<p>
  If you want to match a meta-character (or a quantifier, see below) literally,
  a backslash is required to escape the special meaning,
  e.g.
</p><ul>
<li><code>https://www\.gogole\.com/</code>
    =~ <code>https://www.google.com/</code>.
</li>
</ul>


<p>
  <code>^</code> and <code>$</code> are both anchors, which match specific positions rather
  than any real characters, e.g.
</p><ul>
<li><code>^https://</code> =~ <code>https://www.google.com/</code>
    while !~ <code>http://www.google.com/search?q=https</code>.
</li>
</ul>


<p>
  Besides <code>^</code> and <code>$</code>, there're other anchors, belonging to the
  <i>Escape Sequences</i>:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Anchor</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>\b</code></td><td class="left">Matches the border of a word</td></tr>
<tr><td class="left"><code>\B</code></td><td class="left">Antonym of <code>\b</code></td></tr>
</tbody>
</table>


<p>
  <code>|</code> means alternation, e.g.
</p><ul>
<li><code>https://www.google.com</code> =~ <code>google|yahoo</code>
    while !~ <code>http://www.bing.com</code>.
</li>
</ul>


<p>
  Actually, <code>|</code> is more useful in <i>groups</i>.
</p>
<p>
  A character class is a group of characters that it matches, e.g.
</p><ul>
<li><code>[aA]</code> =~ either <code>a</code> or <code>A</code>
</li>
</ul>


<p>
  Hyphens <code>-</code> in character classes mean a range of characters in
  ASCII table, e.g.
</p><ul>
<li><code>[a-z]</code> =~ any lowercase letter
</li>
<li><code>[0-9]</code> =~ any digit
</li>
</ul>


<p>
  <b>NOTE:</b>
  To place a literal hyphen in a character class,
  use <code>\-</code> instead.
  <code>-</code> is literal in other context.
</p>
<p>
  There're some predefined "character classes",
  also in the form of <i>Escape Sequences</i>:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Escape Sequence</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>\w</code></td><td class="left">Matches a word character (alphanum, underscore)</td></tr>
<tr><td class="left"><code>\W</code></td><td class="left">Antonym of <code>\w</code></td></tr>
<tr><td class="left"><code>\d</code></td><td class="left">Matches a digit</td></tr>
<tr><td class="left"><code>\D</code></td><td class="left">Antonym of <code>\d</code></td></tr>
<tr><td class="left"><code>\ddd</code></td><td class="left">Matches the No.ddd (OCT) ASCII character</td></tr>
<tr><td class="left"><code>\xdd</code></td><td class="left">Matches the No.dd (HEX) ASCII character</td></tr>
<tr><td class="left"><code>\udddd</code></td><td class="left">Matches the No.dddd (HEX) Unicode character</td></tr>
</tbody>
</table>


<p>
  Another basic component of <i>RegExp</i> is quantifiers,
  they're used as suffixes after characters, meta-characters or <i>groups</i>,
  to indicate how many time the character should be repeated:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Quantifier</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>*</code></td><td class="left">Zero or more, as many as possible</td></tr>
<tr><td class="left"><code>+</code></td><td class="left">At least one, as many as possible</td></tr>
<tr><td class="left"><code>?</code></td><td class="left">Zero or one, as many as possible</td></tr>
<tr><td class="left"><code>{N}</code></td><td class="left">Exactly N</td></tr>
<tr><td class="left"><code>{N,}</code></td><td class="left">At least N, as many as possible</td></tr>
<tr><td class="left"><code>{N,M}</code></td><td class="left">Between N and M, as many as possible</td></tr>
</tbody>
</table>


<p>
  e.g.
</p><ul>
<li><code>^https://www\.google\.com/*</code>
    =~ any URL begins with <code>https://www.google.com/</code>;
</li>
<li><code>^http?://</code>
    =~ any URL begins with <code>http://</code> or <code>https://</code>.
</li>
</ul>


<p>
  By default, <i>Redirector</i> matches in "greedy" mode,
  which means it will match as many characters as possible.
  Place a <code>?</code> after the quantifier to turn it to "lazy" mode,
  e.g.
</p><ul>
<li><code>https://.*?\.</code> will match <code>https://www.</code> in string
    <code>https://www.google.com</code>
    while <code>https://.*\.</code> will match <code>https://www.google.</code>.
</li>
</ul>


<p>
  One pattern can be isolated through the use of parentheses, called
  <i>grouping</i>:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Grouping</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>(&hellip;)</code></td><td class="left">Capturing grouping</td></tr>
<tr><td class="left"><code>(?:&hellip;)</code></td><td class="left">Non-capturing grouping</td></tr>
</tbody>
</table>


<p>
  Contents in capturing groups are automatically saved in special
  variables <code>\1</code> to <code>\99</code>,
  numbered from left to right, from outside to inside.
  Capturing groups can do <i>back reference</i>,
  e.g.
</p><ul>
<li><code>http://(\w+)\.wikipedia\.org/\1/</code> =~
    <code>http://zh.wikipedia.org/zh/Google</code>
    while !~ <code>http://zh.wikipedia.org/zh-cn/Google</code>
</li>
</ul>


<p>
  In <i>RegExp</i>, <i>Extended Pattern</i> is of the form
  <code>(?x&hellip;)</code>, e.g. <code>(?:&hellip;)</code>.
  Here are the rest:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Extended Pattern</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>(?=&hellip;)</code></td><td class="left">Followed by <code>&hellip;</code></td></tr>
<tr><td class="left"><code>(?!&hellip;)</code></td><td class="left">Antonym of <code>(?=&hellip;)</code></td></tr>
</tbody>
</table>


<p>
  The pattern <code>(?!&hellip;)</code> is quite useful,
  as <i>Redirector</i> doesn't come with the so-called <i>blacklist</i>,
  because you can completely avoid its use.
  For example, for a rule matching <code>A</code> but not matching <code>B</code>,
  you may compose it as <code>^(?!.*B).*A</code>.
  e.g.
</p><ul>
<li>Compose a <i>Match</i> pattern matching all URL belong to google.com
    and its subdomains but code.google.com:
<ul>
<li><code>^(?!.*https?://code\.google\.com)https?://(.*?\.)?google\.com</code>
</li>
<li>A more compact one:
      <code>^https?://(?!code)(.*?\.)?google.com</code>
</li>
</ul>

</li>
</ul>


<p>
  <b>Note:</b>
  <code>(?=&hellip;)</code> or <code>(?!&hellip;)</code> captures nothing.
</p>
</div>

</div>
