trunk/raw/documents/en.org
* Advanced Substitution & Replacement
  As well as matching, /RegExp/ is a powerful tool for substitution.
  Syntax here is similar, we only discuss the differences.

  The main difference is /grouping/, while contents in capturing
  groups can also be used in /Replacement/.
  To be on the safe side, always replace capturing groups with
  non-capturing ones if they're not intended to be captured.

  Rather than being a literal string, /Replacement/ can also
  be part of /Substitution/.
  This is achieved with the dollar sign ~$~:

| Special replacement | Meaning                                    |
|---------------------+--------------------------------------------|
| ~$N~ (~$1~ - ~$99~) | Matched content in the Nth capturing group |
| ~$&~                | What /Substitution/ matches                |
| ~$`~                | The unmatched part on the left of ~$&~     |
| @<code>$'@</code>   | The unmatched part on the right of ~$&~    |

  ~$1~ - ~$99~ are corresponding to ~\1~ - ~\99~ in
  [[ADVANCED_MATCH][Advanced Match]].

  Here're some examples:
  - With /Substitution/ being ~(^[^\.]+[^/]+)/[^/]*~
    and /Replacement/ being ~$1/zh-cn~,
    ~http://zh.wikipedia.org/zh-hk/Google~
    -> ~http://zh.wikipedia.org/zh-cn/Google~ ；

  - With /Substitution/ being ~[^\.]+[^/]+~
    and /Replacement/ being ~$&.sixxs.org~,
    ~http://www.google.com/~ -> ~http://www.google.com.sixxs.org/~.

  *NOTE:*
  For an /anchor/, /Replacement/ is inserted to the matched position,
  e.g.
  - With /Substitution/ being ~$~ and /Replacement/ being ~ncr~,
    ~http://www.google.com/~ -> ~http://www.google.com/ncr~.

* Troubleshooting
  For the sake of efficiency,
  /Redirector/ doesn't do strict check with a rule during run-time.
  As a result, you may run into this problem:

  - The bottom-left corner shows "Waiting for extension /Redirector/" ::
    This indicates you probably got a bad rule
    that matches the current URL
    but makes /Redirector/ puzzled on how to manipulate it.

  If you are sure a problem results from bugs of /Redirector/,
  send a bug report to <CyrilFeng at gmail dot com>.
  Before that, make sure you've gone through the following steps:
  - Make sure the problem will disappear once /Redirector/ is disabled;

  - Make sure you've installed the latest release (both /Cr/ and /Redirector/);

  - When recreate the problem, set the language of /Redirector/ to
    Chinese or English if possible;

  - Problem should be described in either Chinese or English;

  - Export the problematic rule(s) together with the debugging results,
    then submit them with the report.

* Suggestions
** Composing efficient /Match/ patterns
   The Quality of /Match/ patterns is the key factor that affecting
   the efficiency of /Redirector/.

   Something must be clarified first:
   - Disabled rules and rules for manual redirections have nothing to do with the efficiency;

   - Though wildcards are translated into /RegExp/ internally,
     the translation only happens when /Redirector/ starts or rules list has any change;

   - To speed up, @<i>RegExp@</i>s are all compiled in advance.
     Even if you don't adopt any suggestion here,
     /Redirector/ will be fast enough when doing matches.

   To write an efficient /Match/ pattern, you should:
   - Prefer /RegExp/ to wildcard ::
     /RegExp/ is more precise in matching;

   - Avoid the use of /Ignore case/ ::
     URLs are commonly in lower-case;

   - Make matching process for unmatched URLs terminate as soon as possible ::
      e.g.
     - If you want to match a URL begins with ~http://~,
       then ~^http://~ is better than ~http://~.

   - Prefer "lazy" mode to "greedy" mode ::
     This is tenable when the matching part is short;

   In addition, you should keep rules for auto-redirection in a reasonable order.

** Composing maintainable @<i>Substitution@</i>s
   As /Cr/ is not redirecting URLs all the time
   (or you've misused /Redirector/),
   You should ensure a /Substitution/ is of maintainability first.
   To do so, you should:
   - Make /Substitution/ short ::
     e.g.
     - Remove unneccessary parts ::
       - Preceding and Trailing ~.*~, ~.+~, etc are all unneccessary,
         use ~$`~, @<code>$'@</code> in /Replacement/ instead.

     - Some frequently-used /Substitution/ patterns ::
       - ~https?://~ ::
         =~ ~http://~ and ~https://~;

       - ~^[^\.]+[^/]+~ ::
           =~ ~protocol://[username[:password]@]domain[:port]~
           (square brackets means optional here).

   - Prefer non-capturing groups to capturing ones ::
     This help to avoid miscounting ~$1~, ~$2~...

-----
