trunk/html/en.html

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><a name="ADVANCED_SUBSTITUTION" id="ADVANCED_SUBSTITUTION"></a><span class="section-number-2">6</span> Advanced Substitution &amp; Replacement</h2>
<div class="outline-text-2" id="text-6">

<p>  As well as matching, <i>RegExp</i> is a powerful tool for substitution.
  Syntax here is similar, we only discuss the differences.
</p>
<p>
  The main difference is <i>grouping</i>, while contents in capturing
  groups can also be used in <i>Replacement</i>.
  To be on the safe side, always replace capturing groups with
  non-capturing ones if they're not intended to be captured.
</p>
<p>
  Rather than being a literal string, <i>Replacement</i> can also
  be part of <i>Substitution</i>.
  This is achieved with the dollar sign <code>$</code>:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Special replacement</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="left"><code>$N</code> (<code>$1</code> - <code>$99</code>)</td><td class="left">Matched content in the Nth capturing group</td></tr>
<tr><td class="left"><code>$&amp;</code></td><td class="left">What <i>Substitution</i> matches</td></tr>
<tr><td class="left"><code>$`</code></td><td class="left">The unmatched part on the left of <code>$&amp;</code></td></tr>
<tr><td class="left"><code>$'</code></td><td class="left">The unmatched part on the right of <code>$&amp;</code></td></tr>
</tbody>
</table>


<p>
  <code>$1</code> - <code>$99</code> are corresponding to <code>\1</code> - <code>\99</code> in
  <a href="#sec-5">Advanced Match</a>.
</p>
<p>
  Here're some examples:
</p><ul>
<li>With <i>Substitution</i> being <code>(^[^\.]+[^/]+)/[^/]*</code>
    and <i>Replacement</i> being <code>$1/zh-cn</code>,
    <code>http://zh.wikipedia.org/zh-hk/Google</code>
    -&gt; <code>http://zh.wikipedia.org/zh-cn/Google</code> ；

</li>
<li>With <i>Substitution</i> being <code>[^\.]+[^/]+</code>
    and <i>Replacement</i> being <code>$&amp;.sixxs.org</code>,
    <code>http://www.google.com/</code> -&gt; <code>http://www.google.com.sixxs.org/</code>.
</li>
</ul>


<p>
  <b>NOTE:</b>
  For an <i>anchor</i>, <i>Replacement</i> is inserted to the matched position,
  e.g.
</p><ul>
<li>With <i>Substitution</i> being <code>$</code> and <i>Replacement</i> being <code>ncr</code>,
    <code>http://www.google.com/</code> -&gt; <code>http://www.google.com/ncr</code>.
</li>
</ul>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Troubleshooting</h2>
<div class="outline-text-2" id="text-7">

<p>  For the sake of efficiency,
  <i>Redirector</i> doesn't do strict check with a rule during run-time.
  As a result, you may run into this problem:
</p>
<dl>
<dt>The bottom-left corner shows "Waiting for extension <i>Redirector</i>"</dt><dd>
<p>
    This indicates you probably got a bad rule
    that matches the current URL
    but makes <i>Redirector</i> puzzled on how to manipulate it.
</p></dd>
</dl>


<p>
  If you are sure a problem results from bugs of <i>Redirector</i>,
  send a bug report to &lt;CyrilFeng at gmail dot com&gt;.
  Before that, make sure you've gone through the following steps:
</p><ul>
<li>Make sure the problem will disappear once <i>Redirector</i> is disabled;

</li>
<li>Make sure you've installed the latest release (both <i>Cr</i> and <i>Redirector</i>);

</li>
<li>When recreate the problem, set the language of <i>Redirector</i> to
    Chinese or English if possible;

</li>
<li>Problem should be described in either Chinese or English;

</li>
<li>Export the problematic rule(s) together with the debugging results,
    then submit them with the report.
</li>
</ul>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Suggestions</h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Composing efficient <i>Match</i> patterns</h3>
<div class="outline-text-3" id="text-8-1">

<p>   The Quality of <i>Match</i> patterns is the key factor that affecting
   the efficiency of <i>Redirector</i>.
</p>
<p>
   Something must be clarified first:
</p><ul>
<li>Disabled rules and rules for manual redirections have nothing to do with the efficiency;

</li>
<li>Though wildcards are translated into <i>RegExp</i> internally,
     the translation only happens when <i>Redirector</i> starts or rules list has any change;

</li>
<li>To speed up, <i>RegExp</i>s are all compiled in advance.
     Even if you don't adopt any suggestion here,
     <i>Redirector</i> will be fast enough when doing matches.
</li>
</ul>


<p>
   To write an efficient <i>Match</i> pattern, you should:
</p><dl>
<dt>Prefer <i>RegExp</i> to wildcard</dt><dd>
<p>
     <i>RegExp</i> is more precise in matching;
</p>
</dd>
<dt>Avoid the use of <i>Ignore case</i></dt><dd>
<p>
     URLs are commonly in lower-case;
</p>
</dd>
<dt>Make matching process for unmatched URLs terminate as soon as possible</dt><dd>
<p>
      e.g.
</p><ul>
<li>If you want to match a URL begins with <code>http://</code>,
       then <code>^http://</code> is better than <code>http://</code>.

</li>
</ul>

</dd>
<dt>Prefer "lazy" mode to "greedy" mode</dt><dd>
<p>
     This is tenable when the matching part is short;
</p></dd>
</dl>


<p>
   In addition, you should keep rules for auto-redirection in a reasonable order.
</p>
</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Composing maintainable <i>Substitution</i>s</h3>
<div class="outline-text-3" id="text-8-2">

<p>   As <i>Cr</i> is not redirecting URLs all the time
   (or you've misused <i>Redirector</i>),
   You should ensure a <i>Substitution</i> is of maintainability first.
   To do so, you should:
</p><dl>
<dt>Make <i>Substitution</i> short</dt><dd>
<p>
     e.g.
</p><dl>
<dt>Remove unneccessary parts</dt><dd>
<ul>
<li>Preceding and Trailing <code>.*</code>, <code>.+</code>, etc are all unneccessary,
         use <code>$`</code>, <code>$'</code> in <i>Replacement</i> instead.

</li>
</ul>

</dd>
<dt>Some frequently-used <i>Substitution</i> patterns</dt><dd>
<dl>
<dt><code>https?://</code></dt><dd>
<p>
         =~ <code>http://</code> and <code>https://</code>;
</p>
</dd>
<dt><code>^[^\.]+[^/]+</code></dt><dd>
<p>
           =~ <code>protocol://[username[:password]@]domain[:port]</code>
           (square brackets means optional here).
</p>
</dd>
</dl>

</dd>
</dl>

</dd>
<dt>Prefer non-capturing groups to capturing ones</dt><dd>
<p>
     This help to avoid miscounting <code>$1</code>, <code>$2</code>&hellip;
</p></dd>
</dl>



<hr/>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-02</p>
<p class="author">Author: Cyril Feng</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
